<?php

return array(
    'SERVICE_CODE' => array(
        0 => '',
        200 => '操作成功',
        403 => '无操作权限',
        404 => '资源不存在',
        500 => '操作失败',

        //用户
        1000 => '表单令牌错误',
        1001 => '请先登入',
        1002 => '登录超时',
        1003 => '用户不存在或被禁用',
        1004 => '密码错误',
        1005 => '验证码错误',
        1006 => '重复注册',
        1007 => '邮箱格式不正确',
        1008 => '密码长度不合法',
        1009 => '用户名长度不合法',
        1010 => "密码不能为空",
        1011 => "您已经登入",
        1012 => '用户名禁止注册',
        1013 => '用户名被占用',
        1014 => '邮箱长度不合法',
        1015 => '邮箱禁止注册',
        1016 => '邮箱被占用',
        1017 => '手机格式不正确',
        1018 => '手机禁止注册',
        1019 => '手机号被占用',
        1020 => "登入成功",
        1021 => '用户不存在',
        1022 => '用户名格式不正确',
        1023 => '无导出数据权限',
        1024 => '无效导出方式',

//        上传
        1100 => '上传成功',
        1101 => '上传失败',
        9998 => '参数错误',
        9999 => '未知错误'
    ),
    'SERVICE_SUCCESS_CODE' => array(200, 1020, 1100),
);
